<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="images:0" type="Parameter" version="opset1">
			<data shape="1,128,64,3" element_type="u8" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="images:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_102" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="const_fold_opt__206_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="3" name="const_fold_opt__206" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__206" />
			</output>
		</layer>
		<layer id="4" name="Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Cast:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="map/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="map/Shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="map/Shape__25" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="map/Shape__25:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="const_starts__26" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8" />
			<output>
				<port id="0" precision="I64" names="const_starts__26">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="const_ends__27" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18" size="8" />
			<output>
				<port id="0" precision="I64" names="const_ends__27">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Broadcast_71" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="map/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="map/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_76" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="map/strided_slice__29" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="map/strided_slice__29:0" />
			</output>
		</layer>
		<layer id="13" name="copy__8/map/while/Less__31" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="copy__8/map/while/Less__31:0" />
			</output>
		</layer>
		<layer id="14" name="copy__8/map/while/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="copy__8/map/while/Less:0" />
			</output>
		</layer>
		<layer id="15" name="map/Const:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="26" size="4" />
			<output>
				<port id="0" precision="I32" names="map/Const:0" />
			</output>
		</layer>
		<layer id="16" name="generic_loop_Loop__24" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="2" />
				<input external_port_id="3" internal_layer_id="1" />
				<input external_port_id="4" internal_layer_id="0" />
				<output axis="0" external_port_id="5" internal_layer_id="16" start="0" end="-1" stride="1" part_size="1" />
				<input external_port_id="-1" internal_layer_id="3" purpose="current_iteration" />
				<output external_port_id="-1" internal_layer_id="23" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="19" to-layer="2" />
			</back_edges>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="I32" />
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="map/TensorArrayStack/TensorArrayGatherV3:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="3" name="i__13" type="Parameter" version="opset1">
						<data shape="" element_type="i64" />
						<rt_info>
							<attribute name="fused_names" version="0" value="i__13" />
						</rt_info>
						<output>
							<port id="0" precision="I64" names="i__13" />
						</output>
					</layer>
					<layer id="2" name="map/while/Identity:0" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Identity:0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="map/while/Identity:0" />
						</output>
					</layer>
					<layer id="1" name="Parameter_86" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Parameter_86" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="0" name="Parameter_93" type="Parameter" version="opset1">
						<data shape="1,128,64,3" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Parameter_93" />
							<attribute name="old_api_map_element_type" version="0" value="f16" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="Constant_91" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="10" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_91" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="Unsqueeze__18" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze__18" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32" names="Unsqueeze__18:0">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="Constant_94" type="Const" version="opset1">
						<data element_type="i64" shape="" offset="10" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_94" />
						</rt_info>
						<output>
							<port id="0" precision="I64" />
						</output>
					</layer>
					<layer id="7" name="Gather__19" type="Gather" version="opset8">
						<data batch_dims="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Gather__19" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I64" />
						</input>
						<output>
							<port id="3" precision="FP32" names="Gather__19:0">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="Constant_96" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="10" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_96" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="Squeeze__21" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze__21" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="Squeeze__21:0">
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="begin_masked__34" type="Const" version="opset1">
						<data element_type="i32" shape="3" offset="30" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__12:0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="begin_masked__34">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="end_masked__35" type="Const" version="opset1">
						<data element_type="i32" shape="3" offset="42" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__12:0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="end_masked__35">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="map/while/strided_slice/stack_2:0" type="Const" version="opset1">
						<data element_type="i32" shape="3" offset="54" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__12:0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="map/while/strided_slice/stack_2:0">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="sub_graph_ending_node_Identity__12:0" type="StridedSlice" version="opset1">
						<data begin_mask="0, 0, 0" end_mask="0, 0, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__12:0" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>3</dim>
							</port>
							<port id="2" precision="I32">
								<dim>3</dim>
							</port>
							<port id="3" precision="I32">
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32" names="sub_graph_ending_node_Identity__12:0">
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="14" name="Constant_103" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="10" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_103" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="Unsqueeze_104" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_104" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="map/while/add/y:0" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="66" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add/y:0" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="map/while/add/y:0" />
						</output>
					</layer>
					<layer id="18" name="sub_graph_ending_node_Identity__11:0" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__11:0" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" names="sub_graph_ending_node_Identity__11:0" />
						</output>
					</layer>
					<layer id="20" name="map/while/Less__32" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less__32" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="FP32" names="map/while/Less__32:0" />
						</output>
					</layer>
					<layer id="21" name="map/while/Less__33" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less__33" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="FP32" names="map/while/Less__33:0" />
						</output>
					</layer>
					<layer id="22" name="sub_graph_ending_node_Identity__10:0" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="sub_graph_ending_node_Identity__10:0" />
						</rt_info>
						<input>
							<port id="0" precision="FP32" />
							<port id="1" precision="FP32" />
						</input>
						<output>
							<port id="2" precision="BOOL" names="sub_graph_ending_node_Identity__10:0" />
						</output>
					</layer>
					<layer id="23" name="Result_105" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Result_105" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL" />
						</input>
					</layer>
					<layer id="19" name="Result_106" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Result_106" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="16" name="Result_107" type="Result" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Result_107" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>128</dim>
								<dim>64</dim>
								<dim>3</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="7" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="21" to-port="0" />
					<edge from-layer="2" from-port="0" to-layer="5" to-port="0" />
					<edge from-layer="2" from-port="0" to-layer="18" to-port="0" />
					<edge from-layer="4" from-port="0" to-layer="5" to-port="1" />
					<edge from-layer="5" from-port="2" to-layer="7" to-port="1" />
					<edge from-layer="6" from-port="0" to-layer="7" to-port="2" />
					<edge from-layer="7" from-port="3" to-layer="9" to-port="0" />
					<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
					<edge from-layer="9" from-port="2" to-layer="13" to-port="0" />
					<edge from-layer="10" from-port="0" to-layer="13" to-port="1" />
					<edge from-layer="11" from-port="0" to-layer="13" to-port="2" />
					<edge from-layer="12" from-port="0" to-layer="13" to-port="3" />
					<edge from-layer="13" from-port="4" to-layer="15" to-port="0" />
					<edge from-layer="14" from-port="0" to-layer="15" to-port="1" />
					<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
					<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
					<edge from-layer="18" from-port="2" to-layer="19" to-port="0" />
					<edge from-layer="18" from-port="2" to-layer="20" to-port="0" />
					<edge from-layer="20" from-port="1" to-layer="22" to-port="0" />
					<edge from-layer="21" from-port="1" to-layer="22" to-port="1" />
					<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
				</edges>
				<rt_info />
			</body>
		</layer>
		<layer id="17" name="Constant_131" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="70" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv1_1/Conv2D__37" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1_1/Conv2D__37:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv1_1/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="102" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv1_1/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1_1/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv1_1/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_144_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1830" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_144" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv1_1/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1_1/conv1_1/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv1_1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1_1/Elu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv1_2/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="1894" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv1_2/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1_2/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv1_2/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_160_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="20326" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_160" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv1_2/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1_2/conv1_2/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv1_2/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1_2/Elu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="pool1/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool1/MaxPool:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv2_1/1/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="20390" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_1/1/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/1/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv2_1/1/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_177_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="38822" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_177" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv2_1/1/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/1/conv2_1/1/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv2_1/1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/1/Elu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv2_1/2/weights/read:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="38886" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv2_1/2/weights/read:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/2/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv2_1/2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_193_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="57318" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_193" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv2_1/2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/2/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_2096_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="57382" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_2096" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_2496" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_2501_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="57446" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_2501" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv2_3/bn/FusedBatchNorm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_3/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Elu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv2_3/1/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="57510" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv2_3/1/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_3/1/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv2_3/1/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_211_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="75942" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_211" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv2_3/1/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_3/1/conv2_3/1/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv2_3/1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_3/1/Elu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2_3/2/weights/read:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="76006" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2_3/2/weights/read:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_3/2/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2_3/2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_227_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="94438" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_227" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv2_3/2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_3/2/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add_1:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv3_1/projection/weights/read:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 1, 1" offset="94502" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv3_1/projection/weights/read:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/projection/weights/read:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv3_1/projection/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/projection/Conv2D:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_2162_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="98598" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_2162" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Multiply_2503" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_2508_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="98662" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_2508" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv3_1/bn/FusedBatchNorm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/bn/FusedBatchNorm:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Elu_1" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Elu_1:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>63</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv3_1/1/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="98726" size="36864" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv3_1/1/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/1/Conv2D_weights_fused_bn">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
