<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,24,94" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_156_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 3, 3" offset="0" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_156" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_156">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/backbone.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_45_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="3456" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_45" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/backbone.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Pad_output_0,/backbone.2/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/AveragePool" type="AvgPool" version="opset1">
			<data kernel="5, 5" strides="5, 5" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/AveragePool_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_1627_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="3584" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_1627" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Pow_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_334" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3586" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ReduceMean_output_0" />
			</output>
		</layer>
		<layer id="14" name="/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/Div_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone.3/Cast" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone.3/Cast_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_52" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="/backbone.3/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/backbone.3/Gather_output_0">
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_54" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone.3/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.3/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone.3/max_pool_2d/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.3/max_pool_2d/MaxPool_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_57" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/backbone.3/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.3/Squeeze_output_0">
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_59" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3626" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone.3/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.3/Transpose_output_0">
					<dim>20</dim>
					<dim>90</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/backbone.3/max_pool_1d/MaxPool" type="MaxPool" version="opset8">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" kernel="1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>90</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.3/max_pool_1d/MaxPool_output_0">
					<dim>20</dim>
					<dim>90</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I64">
					<dim>20</dim>
					<dim>90</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_62" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3650" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone.3/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>90</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.3/Transpose_1_output_0">
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_64" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone.3/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.3/Concat_output_0,/backbone.3/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="backbone.4.block.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 64, 1, 1" offset="3674" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="backbone.4.block.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.4.block.0.weight">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/backbone.4/block/block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_78_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="7770" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_78" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone.4/block/block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.4/block/block.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone.4/block/block.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.4/block/block.1/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="backbone.4.block.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 1" offset="7834" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="backbone.4.block.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.4.block.2.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone.4/block/block.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_94_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="13978" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_94" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone.4/block/block.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.4/block/block.2/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone.4/block/block.3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.4/block/block.3/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="backbone.4.block.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 3" offset="14042" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="backbone.4.block.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.4.block.4.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone.4/block/block.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_110_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="20186" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_110" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone.4/block/block.4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.4/block/block.4/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone.4/block/block.5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.4/block/block.5/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Conv_159_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 32, 1, 1" offset="20250" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Conv_159" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_159">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone.4/block/block.6/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_126_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="28442" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_126" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone.4/block/block.6/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.4/block/block.6/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/backbone.6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Pad_1_output_0,/backbone.6/Relu_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/AveragePool_1" type="AvgPool" version="opset1">
			<data kernel="5, 5" strides="5, 5" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/AveragePool_1_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_1628_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="3584" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_1628" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/Pow_1" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Pow_1_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_344" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3586" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/ReduceMean_1_output_0" />
			</output>
		</layer>
		<layer id="64" name="/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/Div_1_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/backbone.7/Cast" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone.7/Cast_output_0" />
			</output>
		</layer>
		<layer id="66" name="Constant_133" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="67" name="/backbone.7/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/backbone.7/Gather_output_0">
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_135" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone.7/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.7/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone.7/max_pool_2d/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.7/max_pool_2d/MaxPool_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_138" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone.7/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.7/Squeeze_output_0">
					<dim>128</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_140" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3626" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/backbone.7/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.7/Transpose_output_0">
					<dim>18</dim>
					<dim>44</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone.7/max_pool_1d/MaxPool" type="MaxPool" version="opset8">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" kernel="1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>18</dim>
					<dim>44</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.7/max_pool_1d/MaxPool_output_0">
					<dim>18</dim>
					<dim>44</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I64">
					<dim>18</dim>
					<dim>44</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_143" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3650" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone.7/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>18</dim>
					<dim>44</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.7/Transpose_1_output_0">
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_145" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3618" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone.7/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.7/Concat_output_0,/backbone.7/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="backbone.8.block.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 1" offset="28698" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="backbone.8.block.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.8.block.0.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone.8/block/block.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_159_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="36890" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_159" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone.8/block/block.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.8/block/block.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone.8/block/block.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.8/block/block.1/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="backbone.8.block.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 1" offset="37018" size="24576" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="backbone.8.block.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.8.block.2.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone.8/block/block.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_175_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="61594" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_175" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone.8/block/block.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.8/block/block.2/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone.8/block/block.3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.8/block/block.3/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="backbone.8.block.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 3" offset="61722" size="24576" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="backbone.8.block.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="backbone.8.block.4.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone.8/block/block.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_191_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="86298" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape_191" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone.8/block/block.4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.8/block/block.4/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone.8/block/block.5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.8/block/block.5/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="onnx::Conv_162_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="86426" size="32768" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="onnx::Conv_162" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_162">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone.8/block/block.6/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_207_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="119194" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_207" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/backbone.8/block/block.6/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone.8/block/block.6/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone.10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone.10/Relu_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>18</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="backbone.11.block.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 256, 1, 1" offset="119706" size="32768" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
